IDENTIFICATION DIVISION.
PROGRAM-ID. CMACCEPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 WS-MOSTRA        PIC X(20) VALUE SPACES.
   PROCEDURE DIVISION.
   
   DISPLAY 'DIGITE ALGO: '
   ACCEPT WS-MOSTRA
   DISPLAY 'WS-MOSTRA: ' WS-MOSTRA ' ' 45 ' TEXTO.....'
   
 
STOP RUN.
