IDENTIFICATION DIVISION.
PROGRAM-ID. CMDINITIALISE.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-NOME.
        03 WS-PRIMEIRO-NOME         PIC X(10) VALUE 'ANDRE'.
        03 FILLER                   PIC X(10) VALUE 'COSTA'.
        03 FILLLER                  PIC 9(03) VALUE 1.
    PROCEDURE DIVISION.
    
        DISPLAY 'SAIDA 1:'
        DISPLAY WS-NOME
        
        DISPLAY 'SAIDA 2:'
        INITIALISE WS-NOME REPLACING ALPHANUMERIC BY SPACES
                                     NUMERIC      BY  ZEROS.  
        DISPLAY WS-NOME
        
        DISPLAY 'SAIDA 3:'
        INITIALISE WS-NOME 
        DISPLAY WS-NOME
        .
        STOP RUN.
        
        CONSOLE
        
        SAIDA 1:
ANDRE     COSTA     001
SAIDA 2:
          COSTA     000
SAIDA 3:
          COSTA     000
