IDENTIFICATION DIVISION.
PROGRAM-ID. CMDSTRING.
DATA DIVISION.
    WORKING-STORAGE SECTION.
77 WS-CONTEUDO                      PIC X(30) VALUE SPACES.
77 WS-TEXTO                      PIC X(40) VALUE SPACES.
PROCEDURE DIVISION.


        INITIALISE WS-CONTEUDO
                   WS-TEXTO
    STRING 
        'ANDRE'
        ' '
        'COSTA'
        DELIMITED BY SIZE INTO WS-CONTEUDO
    END-STRING
    
    DISPLAY WS-CONTEUDO 
    

        INITIALISE WS-CONTEUDO
                   WS-TEXTO
         
    MOVE 'O ANDRE COSTA ESTA MINISTRANDO CURSO' TO WS-TEXTO
    STRING 
        WS-TEXTO(1:7)
        WS-TEXTO(15:22)
        DELIMITED BY SIZE INTO WS-CONTEUDO
    END-STRING
    
    DISPLAY WS-CONTEUDO 
    
    INITIALISE WS-CONTEUDO
                   WS-TEXTO
         
    MOVE 'O ANDRE; COSTA ESTA MINISTRANDO CURSO' TO WS-TEXTO
    STRING 
        WS-TEXTO(1:7)
        ' '
        WS-TEXTO(15:22)
        DELIMITED BY ';' INTO WS-CONTEUDO
    END-STRING
    
    DISPLAY WS-CONTEUDO 

STOP RUN.
